export function AboutUs() {
    return (
        <section className="flex flex-col items-center">
            <div className="bg-[url('src/img/Haze-Corporation.png')] bg-no-repeat bg-center bg-contain w-[700px] h-[250px]"></div>
            <p className="mb-2">
                    Haze Corporation — это научно информационная организация, занимающаяся исследованиями в области биохимии, а так же предоставлением различного рода IT-услуги.
                Корпорация обхватывает огромные спекторы в информационных технологиях, включая создание и поддержку сайтов различного рода и предназначения, разработку программного обеспечения различного уровня.
            </p>
            <p>
                    Haze Cloud — это инновационное облачное хранилище данных, разработанное нами. Оно предназначено для обеспечения безопасности и надёжности хранения информации, а также иметь доступ к ним из любой точки мира через интернет.
                Наш продукт обеспечивает безопасное хранение не только гражданам, но и организациям и компаниям разных отраслей.
            </p>
            <div className="flex w-[800px] mt-10 flex-wrap justify-center gap-2.5">
                <div className="w-[390px] flex gap-2 items-center shadow-sm rounded-xl p-2">
                    <div className="block w-[50px] h-[50px] rounded-full bg-(--color-haze)">
                        <span className="flex justify-center items-center h-full">
                            <svg fill="#ffffff" width="30px" height="30px" viewBox="0 0 32 32" version="1.1" xmlns="http://www.w3.org/2000/svg"><g id="SVGRepo_bgCarrier" strokeWidth="0"></g><g id="SVGRepo_tracerCarrier" strokeLinecap="round" stroke-Lnejoin="round"></g><g id="SVGRepo_iconCarrier"> <path d="M16.114-0.011c-6.559 0-12.114 5.587-12.114 12.204 0 6.93 6.439 14.017 10.77 18.998 0.017 0.020 0.717 0.797 1.579 0.797h0.076c0.863 0 1.558-0.777 1.575-0.797 4.064-4.672 10-12.377 10-18.998 0-6.618-4.333-12.204-11.886-12.204zM16.515 29.849c-0.035 0.035-0.086 0.074-0.131 0.107-0.046-0.032-0.096-0.072-0.133-0.107l-0.523-0.602c-4.106-4.71-9.729-11.161-9.729-17.055 0-5.532 4.632-10.205 10.114-10.205 6.829 0 9.886 5.125 9.886 10.205 0 4.474-3.192 10.416-9.485 17.657zM16.035 6.044c-3.313 0-6 2.686-6 6s2.687 6 6 6 6-2.687 6-6-2.686-6-6-6zM16.035 16.044c-2.206 0-4.046-1.838-4.046-4.044s1.794-4 4-4c2.207 0 4 1.794 4 4 0.001 2.206-1.747 4.044-3.954 4.044z"></path> </g></svg>
                        </span>
                    </div>
                    <span>
                        636 Mau Taun, Aurora, Trinity, AF
                    </span>
                </div>
                <div className="w-[400px] flex gap-2 items-center shadow-sm rounded-xl p-2">
                    <div className="block w-[50px] h-[50px] rounded-full bg-(--color-haze)">
                        <span className="flex justify-center items-center h-full">
                            <svg fill="#ffffff" width="30px" height="30px" viewBox="0 0 32 32" version="1.1" xmlns="http://www.w3.org/2000/svg"><g id="SVGRepo_bgCarrier" strokeWidth="0"></g><g id="SVGRepo_tracerCarrier" strokeLinecap="round" strokeLinejoin="round"></g><g id="SVGRepo_iconCarrier"> <path d="M8.194 1.156c1.169 1.612 2.563 3.694 4.175 6.237 0.406 0.688 0.344 1.512-0.181 2.481-0.2 0.406-0.706 1.331-1.512 2.787 0.887 1.25 2.238 2.787 4.056 4.6s3.331 3.169 4.538 4.056c1.45-0.85 2.381-1.369 2.788-1.575 0.525-0.281 1.031-0.425 1.512-0.425 0.363 0 0.688 0.081 0.969 0.244 1.856 1.131 3.956 2.525 6.294 4.175 0.444 0.325 0.694 0.769 0.756 1.331 0.063 0.569-0.113 1.169-0.512 1.819-0.2 0.281-0.525 0.694-0.969 1.244-0.444 0.544-1.113 1.231-2 2.056s-1.613 1.244-2.181 1.244h-0.063c-4.269-0.169-9.531-3.369-15.762-9.6-6.237-6.238-9.438-11.494-9.6-15.769 0-0.563 0.412-1.3 1.244-2.212 0.825-0.906 1.506-1.563 2.025-1.969 0.525-0.4 0.969-0.725 1.331-0.969 0.444-0.325 0.95-0.481 1.513-0.481 0.694 0 1.212 0.244 1.581 0.725zM6.194 2.425c-0.85 0.606-1.644 1.287-2.394 2.031-0.744 0.75-1.181 1.3-1.3 1.662 0.163 3.756 3.156 8.537 8.988 14.35s10.625 8.819 14.375 9.019c0.325-0.119 0.856-0.563 1.606-1.331s1.425-1.575 2.025-2.419c0.119-0.163 0.163-0.3 0.119-0.425-2.419-1.694-4.438-3.044-6.056-4.056-0.163 0-0.363 0.063-0.606 0.181-0.363 0.2-1.269 0.706-2.725 1.512l-1.031 0.606-1.031-0.669c-1.331-0.925-2.944-2.363-4.844-4.3-1.894-1.894-3.306-3.512-4.238-4.844l-0.725-0.969 0.606-1.088c0.806-1.45 1.313-2.363 1.512-2.725 0.119-0.244 0.181-0.444 0.181-0.606-1.438-2.294-2.769-4.313-3.981-6.050h-0.063c-0.156 0-0.3 0.044-0.419 0.119z"></path> </g></svg>
                        </span>
                    </div>
                    <span>
                        AF: 22-63375, RF: 79(498)54-55-55
                    </span>
                </div>
                <div className="w-[400px] flex gap-2 items-center shadow-sm rounded-xl p-2">
                    <div className="block w-[50px] h-[50px] rounded-full bg-(--color-haze)">
                        <span className="flex justify-center items-center h-full">
                            <svg fill="#ffffff" width="30px" height="30px" viewBox="0 0 32 32" xmlns="http://www.w3.org/2000/svg"><g id="SVGRepo_bgCarrier" strokeWidth="0"></g><g id="SVGRepo_tracerCarrier" strokeLinecap="round" strokeLinejoin="round"></g><g id="SVGRepo_iconCarrier"> <path d="M29.51,21.52a1,1,0,0,0,0-2h-5V16.8l5.25-1.32a1,1,0,0,0-.49-1.94l-4.86,1.22A8.57,8.57,0,0,0,20,8.52V7a4,4,0,0,0-.75-2.33l3.41-2.92A1,1,0,1,0,21.36.24L17.69,3.39A4,4,0,0,0,16,3a4,4,0,0,0-1.68.39L10.65.24A1,1,0,0,0,9.34,1.76l3.41,2.92A4,4,0,0,0,12,7V8.52a8.57,8.57,0,0,0-4.41,6.24L2.73,13.54a1,1,0,0,0-.49,1.94L7.49,16.8v2.72h-5a1,1,0,0,0,0,2h5v2.72L2.24,25.56a1,1,0,0,0,.25,2,.66.66,0,0,0,.24,0L7.6,26.28a8.47,8.47,0,0,0,3.31,5.52,1,1,0,0,0,.61.2h.16a1.08,1.08,0,0,0,.67-.43l.51-.77a8,8,0,0,0,6.28,0l.51.77a1.08,1.08,0,0,0,.67.43h.16a1,1,0,0,0,.61-.2,8.47,8.47,0,0,0,3.31-5.52l4.87,1.21a.66.66,0,0,0,.24,0,1,1,0,0,0,.25-2l-5.25-1.32V21.52ZM14,7a2,2,0,1,1,4,0v.74h-.06l-.24-.06s-.05,0-.07,0A8.93,8.93,0,0,0,16,7.51a8.73,8.73,0,0,0-1.62.17.21.21,0,0,1-.08,0l-.24.06H14Zm2.5,2.53v.1a8.34,8.34,0,0,0-1,0v-.1A5.57,5.57,0,0,1,16.5,9.54Zm-3,1.22V26.22L11.67,29h0l-.35.53A6.41,6.41,0,0,1,9.49,25V16a6.53,6.53,0,0,1,3.9-5.95h0l.1,0ZM14,29.09l1.34-2a1,1,0,0,0,.17-.56V11.63a5.57,5.57,0,0,1,1,0V26.52a1,1,0,0,0,.17.56l1.34,2A6.15,6.15,0,0,1,14,29.09ZM22.51,25a6.41,6.41,0,0,1-1.83,4.48L20.33,29h0L18.5,26.22V10l.1,0h0a6.54,6.54,0,0,1,3.9,6Z"></path> </g></svg>
                        </span>
                    </div>
                    <div className="flex flex-col">
                        <span>
                            Bug Report:
                        </span>
                        <span>
                            haze_corp@hc.com
                        </span>
                    </div>
                </div>
            </div>
        </section>
    )
}